{
  "weatherbit": "Mary West @ SparkFun Electronics \nRyan Mortenson https://github.com/ryanjmortenson\nJune 13, 2017\nhttps://github.com/sparkfun/pxt-weather-bit\nDevelopment environment specifics:\nWritten in Microsoft PXT\nTested with a SparkFun weather:bit for micro:bit\n* This code is released under the [MIT License](http://opensource.org/licenses/MIT).\nPlease review the LICENSE.md file included with this example. If you have any questions \nor concerns with licensing, please contact techsupport@sparkfun.com.\nDistributed as-is; no warranty is given.\n\nFunctions to operate the weather:bit\n\nMary West @ SparkFun Electronics \nRyan Mortenson https://github.com/ryanjmortenson\nHarry Fairhead @ IoT-Programmer \nJune 13, 2017\nhttps://github.com/sparkfun/pxt-weather-bit\n* Development environment specifics:\nWritten in Microsoft PXT\nTested with a SparkFun weather:bit for micro:bit\n* This code is released under the [MIT License](http://opensource.org/licenses/MIT).\nPlease review the LICENSE.md file included with this example. If you have any questions \nor concerns with licensing, please contact techsupport@sparkfun.com.\nDistributed as-is; no warranty is given.",
  "weatherbit.altitude": "Lire le capteur de pression atmosphérique (altimètre), ajuster en fonction de la pression au niveau de la mer\net retourner l'altitude absolue en mètres (m) avec deux décimales.",
  "weatherbit.humidity": "Lire le capteur d’humidité (hygromètre), diviser le nombre de 5 chiffres par 1024 et retourner un résultat d'humidité relative (%).",
  "weatherbit.pressure": "Lire le capteur de pression atmosphérique (baromètre), diviser le nombre de 8 chiffres par 25600\net retourner un résultat en hectopascal (hPa) avec deux décimales.",
  "weatherbit.rain": "Lire le capteur de précipitation (pluviomètre). Calculer la fréquence à laquelle la jauge se remplit et se vide.\nRetourner la quantité en pouce de précipitations.",
  "weatherbit.soilMoisture": "Lire le capteur d'humidité du sol et retourner un résultat entre 0 et 1023 (sur l’échelle analogique, 0 signifie sec et 1023 signifie humide).\nCe n'est pas un hygromètre pour mesurer l'humidité de l'air ambiant, mais un circuit électrique mesurant la conductance du sol (l'eau est un conducteur d’électricité).",
  "weatherbit.soilTemperature": "Lire la température à partir d'un capteur numérique, diviser le nombre de 4 chiffres par 100\net retourner la température en centième de degrés Celsius.",
  "weatherbit.startRainMonitoring": "Régler la broche P02 et activer la récolte des influx du pluviomètre.\nLe pluviomètre capte les précipitations.",
  "weatherbit.startWeatherMonitoring": "Activer le pilote de la carte BME. Cette carte capte des données atmosphériques grâce à ses capteurs de température,\nd'humidité ambiante, de pression et d’altitude reliés par le protocole I2C. La carte peut aussi envoyer ses données par le protocole UART.",
  "weatherbit.startWindMonitoring": "Activer l’anémométrie. Activer la récolte des influxdu capteur de la vitesse du vent (anémomètre).",
  "weatherbit.temperature": "Lire le capteur de températures (thermomètre), diviser le nombre de 4 chiffres par 100\net retourner un résultat en degrés Celsius (C) avec deux décimales.",
  "weatherbit.windDirection": "Lire le capteur de la direction du vent (girouette).\nRetourner une chaîne de caractères indiquant une des 8 directions (N, E, S, W, NE, NW, SE, SW).",
  "weatherbit.windSpeed": "Lire le capteur de la vitesse du vent (anémomètre).\nRetourner la vitesse en miles par heure (mph) chaque 2 secondes."
}
